---
kind: other
id: Methods.T:Autodesk.Revit.DB.IFC.IFCTransaction
source: html/9c8fc5c9-1e7a-bfb3-c8cc-124b64df4cc5.htm
---
# IFCTransaction Methods

Commits all changes made to the IFC file during the transaction.